# 任务：创建`variables_demo.py`文件，手工编写并运行以下代码。通过`input()`动态获取用户输入，利用`type()`函数查看数据类型。
"""
程序名称：variables_demo.py
作者：黄乐源
日期：2026-06-29
描述：探索Python基础数据类型与变量交互
"""

print("--- 任务 1：变量定义与数据类型查看 ---")
# 通过键盘获取变量值
name = input("请输入你的姓名: ")
sex = input("请输入你的性别：")
age = input("请输入你的年龄：")
gpa = input("请输入你的平均绩点：")

# 输出获取到的变量值及其默认的数据类型（字符串）
print("####################默认（未转换前）####################")
print("你的姓名为：", name, "| 数据类型为：", type(name))
print("你的性别为：", sex, "| 数据类型为：", type(sex))
print("你的姓名为：", age, "| 数据类型为：", type(age))
print("你的平均绩点为：", gpa, "| 数据类型为：", type(gpa))
print("#####################################################\n")

# input()函数获取到的数据为字符串类型，需要进行显式类型转换
age = int(str(age))     #将age转换成整数类型
gpa = float(str(gpa))   #将gpa转换成浮点数类型

# 输出获取到的变量值及其默认的数据类型（字符串）
print("########################转换后########################")
print("你的姓名为：", name, "| 数据类型为：", type(name))
print("你的性别为：", sex, "| 数据类型为：", type(sex))
print("你的姓名为：", age, "| 数据类型为：", type(age))
print("你的平均绩点为：", gpa, "| 数据类型为：", type(gpa))
print("#####################################################")
print("________________________________________________________________________________________")

# 查看指定数据的类型是否为指定类型
print("姓名的数据类型是否为整数：",isinstance(name,int))
print("姓名的数据类型是否为字符串：",isinstance(name,str))

print("\n--- 任务 2：GeoAI 场景模拟之变量交换 ---")
# 模拟遥感影像处理中，由于通道调整需要交换波段编号（例如红波段与近红外波段）
band_red = 3
band_nir = 4
print("交换前红波段编号：", band_red, "交换前近红外波段编号：", band_nir)
print("##########################################################")

# 方法一：引入中间变量band_temp
band_temp = band_red
band_red = band_nir
band_nir = band_temp
print("引入中间变量交换后红波段编号：", band_red, "交换后近红外波段编号：", band_nir)
# 方法二：Python特色的优雅变量交换
band_red = 3
band_nir = 4
band_red, band_nir = band_nir, band_red
print("通过Python特色的优雅变量交换后红波段编号：", band_red, "交换后近红外波段编号：", band_nir)
print("________________________________________________________________________________________")