# 算术运算符： + - * / // % **
print("10 + 4 =",10 + 4)    # 加
print("10 - 4 =",10 - 4)    # 减
print("10 * 4 =",10 * 4)    # 乘
print("10 / 4 =",10 / 4)    # 除
print("10 // 4 =",10 // 4)  # 整除
print("10 % 4 =",10 % 4)    # 取余
print("10 ** 4 =",10 ** 4)  # 幂指数

# 算术运算符的优先级 --> ** --> * / // % --> + -
print("0.1 + 10 / 4**2 =",0.1 + 10 / 4**2)

# 案例：要求输入两个数x与y，分别输出x+y的结果和x-y的结果
# float() ---> 将其他类型转为浮点数类型
x = float(input("请输入x的值："))
y = float(input("请输入y的值："))

# 当计算0.5 - 0.4得到0.09999999999999998 --> 精度损失；由于计算机底层是基于二进制进行数据的存储与处理，二进制无法准确表示所有小数，因此涉及到浮点数的运算时可能损失精度
print(f"{x} + {y} = {x + y}")
print(f"{x} - {y} = {x - y}")
print("___________________________________________\n")

# 赋值运算符：= += -+ *= /= %= //= **=
num = 85

num += 10
print("num += 10后，num =",num)   #num = 85 + 10 = 95

num -= 10
print("num -= 10后，num =",num)   # num = 95 - 10 = 85

num *= 10
print("num *= 10后，num =",num)   # num = 85 * 10 = 850

num /= 10
print("num /= 10后，num =",num)   # num = 850 / 10 = 85.0（除法运算的结果为小数）

num //= 10
print("num //= 10后，num =",num)  # num = 85.0 // 10 = 8.0（有浮点数参与到运算中，故结果为小数）

num %= 3
print("num %= 10后，num =",num)   # num = 8.0 % 3 = 2.0（有浮点数参与到运算中，故结果为小数）

num **= 3
print("num **= 10后，num =",num)  # num = 2.0 ** 3 = 8.0（有浮点数参与到运算中，故结果为小数）
print("___________________________________________\n")

# 比较运算符：== != > >= < <=
print("100 == 100 吗：",100 == 100)   # True
print("'100' == '100' 吗：",100 == 100)   # True
print("100 != 100 吗：",100 != 100)   # False

print("100 < 100 吗：",100 < 100)     # False
print("100 <= 100 吗：",100 <= 100)   # True

print("100 > 100 吗：",100 > 100)     # False
print("100 >= 100 吗：",100 >= 100)   # True
print("___________________________________________\n")

# 案例：思考如下需求需要使用哪种比较运算符
# 思考1：数学计算中，判断一个数是否为偶数，使用哪个关系运算符呢?   使用num % 2 == 0来判断，True则为偶数，False则为奇数
# 思考2：电商项目的支付功能业务，需要判断银行卡余额是否足够，使用哪个关系运算符呢?  使用total >= payment来判断，True则足够，False则不足够
# 思考3：电商项目的购买商品业务，需要判断货物的库存是否足够，使用哪个关系运算符呢?  使用inventory >= buy来判断，True则足够，False则不足够
# 思考4：点餐项目的筛选商品业务，需要点不超过100元的，使用哪个关系运算符呢?    使用price <= 100来判断，True则未超过100，False则超过100

# 逻辑运算符：与(and) 或(or) 非(not)
# 需求1：键盘输入一个整数，判断这个数字是否在10-20之间。
num = int(input("请输入一个整数："))
print(f"10 <= {num} <= 20 是否成立：",num >= 10 and num <= 20)   # and连接的条件是并且的关系，两条件同时True结果才是True，否则为False

# 需求2：键盘输入一个整数，判断这个数字是否不在10-20之间。
num1 = int(input("请输入一个整数："))
print(f"10 <= {num1} <= 20 是否不成立：",num1 <= 10 or num1 >= 20)    # or连接的条件是或者的关系，只要其中有一个成立结果就是True，全部不成立结果才是False










