# # if条件判断：如果分数超过680，我就去清华读书
# score = int(input("请输入您的高考分数："))
# if score > 680:
#     print("恭喜您的分数达到清华大学录取分数线，欢迎来到清华大学就读！")
#     print("也恭喜你即将踏入精彩的大学生活。")
# print("_________________________________________________________")

# 案例：输入账号密码后登录B站
# 需求：结合前面学习的输入输出及if条件判断的知识，完成B站登录功能的实现(正确账号和密码为18888888888/666888)

# 正确的账号密码
correct_id = "18888888888"
correct_psd = "666888"

# 从键盘获取用户输入的账号密码
print("欢迎来到哔哩哔哩！")
input_id = input("请输入您的帐号：")
input_psd = input("请输入您的密码：")

# 判断账号密码是否全部正确，如果都正确则登陆成功，进入B站首页
if input_id == correct_id and input_psd == correct_psd:
    print("登陆成功！欢迎来到B站首页！")

# 判断账号密码是否有错误的，如果有任何一个错误则登陆失败，提示错误信息
if input_id != correct_id or input_psd != correct_psd:
    print("账号或密码错误！请检查后重新输入！")